# LoadCase Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
LoadBase..::..LoadCase Property
LoadBase Class See Also
---
The load case for the load.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public LoadCase LoadCase { get; }
```

Visual Basic
---
```text
Public ReadOnly Property LoadCase As LoadCase
	Get
```

Visual C++
---
```text
public:
property LoadCase^ LoadCase {
	LoadCase^ get ();
}
```

# See Also
LoadBase Class
Autodesk.Revit.DB.Structure Namespace